{
  "main": {
    "name": "Adam Khamlichi",
    "occupation": " Software Engineer student",
    "description": " currently studying at ",
    "employer": "Polytechnique de Montréal",
    "jobDescription": "learn code, conceive projects, and try my best at problem-solving",
    "image": "PhotoProfessionel.JPG",
    "bio": "I am a big fan of sports, I love cuisine, and I am a history buff. Born in Montreal, I am originally from Morocco, land of the greatest food on this planet (convince me otherwise).  I am now studying as a Software Engineer and I am looking for experience to hone my coding skills. I am a dreamer who wants to execute my dreams into this reality and I love learning about new cultures. I am a people person that is open-minded to everything new. ",
    "contactmessage": "Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "khamlichi710@gmail.com",
    "phone": "(514) 261-1737",
    "address": {
      "city": "Montreal",
      "state": "Quebec"
    },
    "website": "https://adamkhamlichi.vercel.app",
    "resumedownload": "https://drive.google.com/file/d/1HDcZ3H-xwnHti1usHIJyrB3Dvjz_qpf1/view?usp=sharing",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/adam-khamlichi-11754a252/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/AdamKhamlichi",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I'm a tinkerer and am always interested in playing around with new technologies but these are the ones that have really won me over",
    "education": [
      {
        "school": "Polytechnique de Montréal",
        "degree": "Bachelors in Computer Science, Software Engineering Option",
        "graduated": "Expected May 2026",
        "description": "A person trained in software engineering at Polytechnique Montréal analyzes, designs, and tests large-scale software systems. They work with the latest technologies in cutting-edge application domains and are responsible for all phases of software product development."
      }
    ],
    "work": [
      {
        "company": "Best Buy",
        "title": "Call Agent",
        "years": "May 2022 - Novembre 2022",
        "description": "Patiently listening to customer complaints while remaining calm, resolving issues remotely, transferring to the appropriate department based on the situations, using call center software, providing effective and courteous customer service"
      },
      {
        "company": "Tutorax",
        "title": "Tutor",
        "years": "November 2022 - September 2023",
        "description": "Communicating with students facing challenges, adapting to their situations to offer guidance, using online communication software, being clear in my explanations to articulate situations"
      }
    ],
    "skills": [
      {
        "name": "Git",
        "description": "I use Git for all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects.",
        "image": "git.jpg"
      },
      {
        "name": "Java",
        "description": "Java was my first programming language that I started using in college years ago. It is by far the language I am most familiar with in terms of data-structure and algorithm programming.",
        "image": "java.jpg"
      },
      {
        "name": "React Js",
        "description": "I am fairly new to React and really did not like it at first. It has grown on me though and I will continue to use it going forward. I have built a ReactJS based resume-website template (link below in portfolio) which I used as a starting point for this personal site.",
        "image": "react.jpg"
      },
      {
        "name": "Node JS",
        "description": "Node JS is my server-side scripting language of choice. The bulk of my experience with it has been in conjunction with MeteorJS-based projects",
        "image": "node.jpg"
      },
      {
        "name": "MongoDB",
        "description": "I have used many different database systems and am better educated and experienced with Relational Databases. However, for many applications, the ease of use of MongoDB better suits my needs and it is much more enjoyable to work with",
        "image": "mongo.jpg"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Spotify Clone",
        "category": "A music player that is based off Spotify",
        "image": "SpotifyClone.png",
        "url": "https://github.com/AdamKhamlichi/SpotifyClone"
      },
      {
        "title": "Escape Game",
        "category": "A game where you need to escape whilst solving clues",
        "image": "fury-fighting-gear.jpg",
        "url": "https://github.com/AdamKhamlichi/ESCAPE-GAME"
      },
      {
        "title": "Movement tracking robot",
        "category": "A robot I built for the Philip and Lily Malouf Prize for Winter 2023",
        "image": "Prix Philip Lila Malouf.jpg",
        "url": "https://cours.polymtl.ca/inf1900/prixMalouf/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Working with Adam is a pleasure. He is very good at combining fun and professionalism to make the experience of work as productive and as memorable as possible. He is passionate and respectful. Adam has good communication skills and is an amazing problem solver",
        "user": "Mohamed Ali Bachar - Freelance Fullstack Developper"
      }
    ]
  }
}
