{
  "main": {
    "name": "Adam Khamlichi",
    "occupation": " Software Engineer student",
    "description": " currently studying at ",
    "employer": "Polytechnique de Montréal",
    "jobDescription": "learn code, conceive projects, and try my best at problem-solving",
    "image": "PhotoProfessionel.JPG",
    "bio": "I am a big fan of sports, I love cuisine, and I am a history buff. Born in Montreal, I am originally from Morocco, land of the greatest food on this planet (convince me otherwise).  I am now studying as a Software Engineer and I am looking for experience to hone my coding skills. I am a dreamer who wants to execute my dreams into this reality and I love learning about new cultures. I am a people person that is open-minded to everything new. ",
    "contactmessage": "Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email",
    "email": "adamkhamlichipro@gmail.com",
    "phone": "(514) 261-1737",
    "address": {
      "city": "Montreal",
      "state": "Quebec",
      "country": "Canada"
    },
    "website": "https://adamkhamlichi.vercel.app",
    "resumedownload": "https://drive.google.com/file/d/1Ajg11LK0QOuKC4xtwnuGh_0lOsuLiuY2/view?usp=sharing",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/adam-khamlichi-11754a252/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/AdamKhamlichi",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I'm a tinkerer and am always interested in playing around with new technologies but these are the ones that I really use",
    "education": [
      {
        "school": "Polytechnique de Montréal",
        "degree": "Bachelors in Computer Science, Software Engineering Option",
        "graduated": "Expected May 2026",
        "description": "A person trained in software engineering at Polytechnique Montréal analyzes, designs, and tests large-scale software systems. They work with the latest technologies in cutting-edge application domains and are responsible for all phases of software product development."
      },
      {
        "school": "Collège Bois-de-Boulogne",
        "degree": "College Degree in Informatical and Mathematical Sciences",
        "graduated": "2022",
        "description": "Completed a comprehensive program combining computer science and mathematics fundamentals. The curriculum covered essential programming concepts, mathematical modeling, and problem-solving techniques. This degree provided strong foundations in algorithmic thinking and analytical skills, preparing for advanced studies in software engineering."
      }
    ],
    "work": [
      {
        "company": "Montreal Heart Institute",
        "title": "Research Student Internship",
        "years": "May 2024 - August 2024",
        "description": "At the Montreal Heart Institute, I am working on a government-funded research project focused on medical applications of artificial intelligence. My responsibilities include developing innovative solutions for previously unresolved healthcare challenges, with a primary focus on creating an application to assist doctors in pre-diagnosis processes. Through this internship, I am gaining hands-on experience with AI technologies in the medical field while contributing to the development of practical healthcare solutions. The project involves collaborating with healthcare professionals to understand their needs and translate them into effective software solutions."
      },
      {
        "company": "Outlier.AI",
        "title": "AI Trainer",
        "years": "December 2024 - Present",
        "description": "As an AI Trainer at Outlier.ai, I am responsible for the comprehensive training and optimization of AI models. My role involves feeding AI models with carefully curated information to ensure accurate training outcomes. I systematically validate model functionality through rigorous testing protocols and implement quality control measures. A key aspect of my position involves teaching AI models to generate contextually appropriate responses by analyzing various scenarios and fine-tuning model outputs. Through this process, I ensure that models not only function correctly but also provide optimal responses based on specific contextual requirements. This work requires a deep understanding of both the technical aspects of AI model training and the importance of context-aware response generation."
      },
      {
        "company": "Best Buy",
        "title": "Call Agent",
        "years": "May 2022 - Novembre 2022",
        "description": "Patiently listening to customer complaints while remaining calm, resolving issues remotely, transferring to the appropriate department based on the situations, using call center software, providing effective and courteous customer service"
      },
      {
        "company": "Tutorax",
        "title": "Tutor",
        "years": "November 2022 - September 2023",
        "description": "Communicating with students facing challenges, adapting to their situations to offer guidance, using online communication software, being clear in my explanations to articulate situations"
      }
    ],
    "skills": [
      {
        "name": "Git",
        "description": "Extensive experience with version control in both individual and team projects. Regularly use Git for collaborative development, branch management, and maintaining clean commit histories across multiple projects.",
        "image": "git.jpg"
      },
      {
        "name": "Java",
        "description": "Strong foundation in Java programming with extensive experience in data structures and algorithms. Used Java for both academic projects and software development, particularly in creating robust backend solutions.",
        "image": "java.jpg"
      },
      {
        "name": "Python",
        "description": "Advanced proficiency in Python, particularly in AI/ML applications. Extensive experience in training and fine-tuning machine learning models, data preprocessing, and creating medical diagnosis applications.",
        "image": "Python.png"
      },
      {
        "name": "C++",
        "description": "Expertise in C++ through robotics projects and embedded systems development. Won the Philip and Lily Malouf Prize for robotics work using C++ and USART32 technologies.",
        "image": "C++_logo.png"
      },
      {
        "name": "TensorFlow",
        "description": "Practical experience in implementing and training AI models using TensorFlow. Developed and maintained models for medical applications and language translation systems with high accuracy rates.",
        "image": "tensorflow.png"
      },
      {
        "name": "React.js",
        "description": "Advanced web development skills using React.js. Created responsive and interactive user interfaces for multiple projects, including medical applications and data visualization dashboards.",
        "image": "react.jpg"
      },
      {
        "name": "MongoDB",
        "description": "Proficient in NoSQL database design and management using MongoDB. Implemented database solutions for AI training data storage and real-time application data management.",
        "image": "mongo.jpg"
      },
      {
        "name": "Machine Learning",
        "description": "Strong theoretical and practical understanding of machine learning concepts. Developed and trained models achieving over 93% accuracy in language translation tasks.",
        "image": "ml.png"
      },
      {
        "name": "SQL",
        "description": "Experienced in designing and managing relational databases. Implemented complex queries and database structures for various applications, ensuring data integrity and efficient retrieval.",
        "image": "sql.png"
      },
      {
        "name": "Docker",
        "description": "Proficient in containerization and deployment using Docker. Experience in creating and managing containers for consistent development and production environments.",
        "image": "docker.jpg"
      },
      {
        "name": "REST APIs",
        "description": "Skilled in designing and implementing RESTful APIs for web applications. Created robust backend services supporting medical diagnosis tools and AI model interfaces.",
        "image": "api.jpg"
      },
      {
        "name": "Embedded Systems",
        "description": "Hands-on experience with embedded systems programming, particularly in robotics. Led team projects utilizing USART32 and other microcontroller technologies.",
        "image": "embedded.png"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Spotify Clone",
        "category": "A music player that is based off Spotify",
        "image": "SpotifyClone.png",
        "url": "https://github.com/AdamKhamlichi/SpotifyClone"
      },
      {
        "title": "Movement tracking robot",
        "category": "A robot I built for the Philip and Lily Malouf Prize for Winter 2023",
        "image": "Prix Philip Lila Malouf.jpg",
        "url": "https://cours.polymtl.ca/inf1900/prixMalouf/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Working with Adam is a pleasure. He is very good at combining fun and professionalism to make the experience of work as productive and as memorable as possible. He is passionate and respectful. Adam has good communication skills and is an amazing problem solver",
        "user": "Mohamed Ali Bachar - Freelance Fullstack Developper"
      }
    ]
  }
}
